app/admin/dashboard.rb

    columns do
      # Users Section
      column do
        panel "<b>Users (#{User.count})</b>".html_safe do
          table_for User.all.limit(5) do
---
SELECT COUNT(*) FROM "users"
SELECT "users".* FROM "users" LIMIT $1  [["LIMIT", 5]]


      # Subdomains Section
      column do
        panel "<b>Subdomains (#{Subdomain.count})</b>".html_safe do
          table_for Subdomain.all.limit(5) do
            column(:name) { |subdomain| link_to subdomain.name, admin_subdomain_path(subdomain) }
            column(:description)
            column(:local_admin) do |subdomain|
              local_admin_users = subdomain.users.select { |user| user.local_admin? }
---
SELECT COUNT(*) FROM "subdomains"
SELECT "subdomains".* FROM "subdomains" LIMIT $1  [["LIMIT", 5]]
SELECT "users".* FROM "users" INNER JOIN "users_subdomains" ON "users"."id" = "users_subdomains"."user_id" WHERE "users_subdomains"."subdomain_id" = $1  [["subdomain_id", 4]]

    columns do
      # Financial Report Section
      column do
        panel "<b>Financial Report (#{FinancialReport.count})</b>".html_safe do
          table_for FinancialReport.all.limit(5) do
---
SELECT COUNT(*) FROM "financial_reports"
SELECT "financial_reports".* FROM "financial_reports" LIMIT $1  [["LIMIT", 5]]


      # Investigations Section
      column do
        panel "<b>Investigations (#{Investigation.count})</b>".html_safe do
          table_for Investigation.all.limit(5) do
---
SELECT COUNT(*) FROM "investigations"
SELECT "investigations".* FROM "investigations" LIMIT $1  [["LIMIT", 5]]

    columns do
      # Reviews Section
      column do
        panel "<b>Reviews (#{Review.count})</b>".html_safe do
          table_for Review.all.limit(5) do
---
SELECT COUNT(*) FROM "reviews"
SELECT "reviews".* FROM "reviews" LIMIT $1  [["LIMIT", 5]]