app/admin/investigations.rb

  permit_params :subdomain_id, :iidm_admin_id, :description, :findings, :attachment

  # Filters for searching
  filter :iidm_admin, as: :select, collection: User.where(role: :iidm_admin).pluck(:name, :id)
  filter :subdomain, as: :select, collection: Subdomain.all.pluck(:name, :id)
---
SELECT "users"."name", "users"."id" FROM "users" WHERE "users"."role" = $1  [["role", 1]]
SELECT "subdomains"."name", "subdomains"."id" FROM "subdomains"