app/admin/reviews.rb

  # Customize the form
  form do |f|
    f.inputs 'Review Details' do
      f.input :subdomain,
        as: :select,
        collection: Subdomain.all,
        include_blank: false
      f.input :public_user,
        as: :select,
        collection: User.where(role: :public_user).pluck(:name, :id),
        include_blank: false
---
SELECT "subdomains".* FROM "subdomains"
SELECT "users"."name", "users"."id" FROM "users" WHERE "users"."role" = $1  [["role", 2]]