app/admin/subdomains.rb

    column :description
    column :local_admins do |subdomain|
      # Retrieve all users with role `local_admin` associated with the subdomain
      subdomain.users.where(role: :local_admin).pluck(:name).join(", ")
---
SELECT "users"."name" FROM "users" INNER JOIN "users_subdomains" ON "users"."id" = "users_subdomains"."user_id" WHERE "users_subdomains"."subdomain_id" = $1 AND "users"."role" = $2  [["subdomain_id", 9], ["role", 0]]

    f.inputs 'Subdomain Details' do
      f.input :name
      f.input :description
      f.input :users,
        as: :select,
        collection: User.where(role: :local_admin).pluck(:name, :id),
        include_blank: false,
        input_html: { multiple: true },
        label: "Local Users"
---
SELECT "users"."name", "users"."id" FROM "users" WHERE "users"."role" = $1  [["role", 0]]

      row :description
      row :local_admins do |subdomain|
        # Retrieve all users with role `local_admin` associated with the subdomain
        subdomain.users.where(role: :local_admin).pluck(:name).join(", ")
---
SELECT "users"."name" FROM "users" INNER JOIN "users_subdomains" ON "users"."id" = "users_subdomains"."user_id" WHERE "users_subdomains"."subdomain_id" = $1 AND "users"."role" = $2  [["subdomain_id", 4], ["role", 0]]