app/admin/users.rb

            as: :select,
            collection: User.roles.keys.map { |role| [role.humanize.titleize, role] },
            include_blank: false
      f.input :subdomains,
            as: :select,
            collection: Subdomain.all.pluck(:name, :id),
            input_html: { multiple: true }
---
SELECT "subdomains"."name", "subdomains"."id" FROM "subdomains"